"""import datetime
start = datetime.datetime.now()
print(1-1)
print(datetime.datetime.now()-start)
"""
l = """Критерии определения победителей и призеров очного отборочного тура Отраслевой физико-математической олимпиады школьников «Росатом» 2024-2025 учебного года по физике от 29 сентября 2024 (г. Москва)

Участники 9-11 класса, ставшие призёрами и победителями данного отборочного тура, допускаются в заключительный тур олимпиады "Росатом" по физике и Инженерной олимпиады школьников. Призёры и победители 7-8 класса - в заключительный тур олимпиады "Росатом" по физике.

Допуски к заключительному туру будут опубликованы в личных кабинетах участников в течение недели (раздел "Результаты участия").

Дипломы призёров и победителей появятся в личных кабинетах участников в течение двух недель (раздел "Результаты участия")."""
l = l.split(" ")
print(len(l))